mlu/cortal_dendrites/cortex_m/usblib/stm32f7/usb_regs.h
/** @defgroup __OUT_Endpoint-Specific_Registers
  * @{
  */
typedef struct _USB_OUTEPREGS
{
  __IO uint32_t DOEPCTL;       /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h*/
  uint32_t Reserved04;         /* Reserved                      B00h + (ep_num * 20h) + 04h*/
  __IO uint32_t DOEPINT;       /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h*/
  uint32_t Reserved0C;         /* Reserved                      B00h + (ep_num * 20h) + 0Ch*/
  __IO uint32_t DOEPTSIZ;      /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h*/
  __IO uint32_t DOEPDMA;       /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h*/
  uint32_t Reserved18[2];      /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch*/
}
USB_OUTEPREGS_Type;
/**
  * @}
  */


/** @defgroup __Host_Mode_Register_Structures
  * @{
  */
typedef struct _USB_HREGS
{
  __IO uint32_t HCFG;             /* Host Configuration Register    400h*/
  __IO uint32_t HFIR;      /* Host Frame Interval Register   404h*/
  __IO uint32_t HFNUM;         /* Host Frame Nbr/Frame Remaining 408h*/
  uint32_t Reserved40C;                   /* Reserved                       40Ch*/
  __IO uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
  __IO uint32_t HAINT;   /* Host All Channels Interrupt Register 414h*/
  __IO uint32_t HAINTMSK;   /* Host All Channels Interrupt Mask 418h*/
}
USB_HREGS;
/**
  * @}
  */


/** @defgroup __Host_Channel_Specific_Registers
  * @{
  */
typedef struct _USB_HC_REGS
{
  __IO uint32_t HCCHAR;
  __IO uint32_t HCSPLT;
  __IO uint32_t HCINT;
  __IO uint32_t HCINTMSK;
  __IO uint32_t HCTSIZ;
  __IO uint32_t HCDMA;
  uint32_t Reserved[2];
}
USB_HC_REGS;
/**
  * @}
  */


/** @defgroup __otg_Core_registers
  * @{
  */
typedef struct USB_core_regs //000h
{
  USB_GREGS_Type         *GREGS;
  USB_DREGS_Type         *DREGS;
  USB_HREGS         *HREGS;
  USB_INEPREGS_Type      *INEP_REGS[USB_MAX_TX_FIFOS];
  USB_OUTEPREGS_Type     *OUTEP_REGS[USB_MAX_TX_FIFOS];
  USB_HC_REGS       *HC_REGS[USB_MAX_TX_FIFOS];
  __IO uint32_t         *HPRT0;
  __IO uint32_t         *DFIFO[USB_MAX_TX_FIFOS];
  __IO uint32_t         *PCGCCTL;
}
USB_CORE_REGS , *PUSB_CORE_REGS;

#define USB_FS_GREGS            ((USB_GREGS_Type *)(USB_FS_BASE_ADDR + USB_CORE_GLOBAL_REGS_OFFSET))
#define USB_FS_DREGS            ((USB_DREGS_Type *)(USB_FS_BASE_ADDR + USB_DEV_GLOBAL_REG_OFFSET))
#define USB_FS_INEP             ((USB_INEPREGS_Type *)(USB_FS_BASE_ADDR + USB_DEV_IN_EP_REG_OFFSET))
#define USB_FS_OUTEP            ((USB_OUTEPREGS_Type *)(USB_FS_BASE_ADDR + USB_DEV_OUT_EP_REG_OFFSET))

typedef union _USB_GOTGCTL_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t sesreqscs :
    1;
uint32_t sesreq :
    1;
uint32_t Reserved2_7 :
    6;
uint32_t hstnegscs :
    1;
uint32_t hnpreq :
    1;
uint32_t hstsethnpen :
    1;
uint32_t devhnpen :
    1;
uint32_t Reserved12_15 :
    4;
uint32_t conidsts :
    1;
uint32_t dbct :
    1;
uint32_t asesvld :
    1;
uint32_t bsesvld :
    1;
uint32_t Reserved20_31 :
    12;
  }
  b;
} USB_GOTGCTL_TypeDef ;

typedef union _USB_GOTGINT_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t Reserved0_1 :
    2;
uint32_t sesenddet :
    1;
uint32_t Reserved3_7 :
    5;
uint32_t sesreqsucstschng :
    1;
uint32_t hstnegsucstschng :
    1;
uint32_t reserver10_16 :
    7;
uint32_t hstnegdet :
    1;
uint32_t adevtoutchng :
    1;
uint32_t debdone :
    1;
uint32_t Reserved31_20 :
    12;
  }
  b;
} USB_GOTGINT_TypeDef ;

/* --------------------------------  USB_GAHBCFG  -------------------------------- */

#define USB_GAHBCFG_GINTMSK_Pos       0				/* Global interrupt mask  				*/
#define USB_GAHBCFG_GINTMSK_Msk       (1<<0)
#define USB_GAHBCFG_TXFELVL_Pos       7				/* TxFIFO empty level  					*/
#define USB_GAHBCFG_TXFELVL_Msk       (1<<7)
#define USB_GAHBCFG_PTXFELVL_Pos      8				/* Periodic TxFIFO empty level  		*/
#define USB_GAHBCFG_PTXFELVL_Msk      (1<<8)

/* --------------------------------  USB_GUSBCFG  -------------------------------- */

#define USB_GUSBCFG_TOUTCAL_Pos       0
#define USB_GUSBCFG_TOUTCAL_Msk       (0x7<<0)
#define USB_GUSBCFG_PHYSEL_Pos        6
#define USB_GUSBCFG_PHYSEL_Msk        (1<<6)
#define USB_GUSBCFG_SRPCAP_Pos        8
#define USB_GUSBCFG_SRPCAP_Msk        (1<<8)
#define USB_GUSBCFG_HNPCAP_Pos        9
#define USB_GUSBCFG_HNPCAP_Msk        (1<<9)
#define USB_GUSBCFG_TRDT_Pos          10
#define USB_GUSBCFG_TRDT_Msk          (0xF<<10)
#define USB_GUSBCFG_FHMOD_Pos         29
#define USB_GUSBCFG_FHMOD_Msk         (1<<29)
#define USB_GUSBCFG_FDMOD_Pos         30
#define USB_GUSBCFG_FDMOD_Msk         (1<<30)
#define USB_GUSBCFG_CTXPKT_Pos        31
#define USB_GUSBCFG_CTXPKT_Msk        (1<<31)

/* --------------------------------  USB_GRSTCTL  -------------------------------- */

#define USB_GRSTCTL_CSRST_Pos         0					/* Core soft reset  */
#define USB_GRSTCTL_CSRST_Msk         (1<<USB_GRSTCTL_CSRST_Pos)
#define USB_GRSTCTL_HSRST_Pos         1					/* HCLK soft reset   */
#define USB_GRSTCTL_HSRST_Msk         (1<<USB_GRSTCTL_HSRST_Pos)
#define USB_GRSTCTL_FCRST_Pos         2					/* Host frame counter reset   */
#define USB_GRSTCTL_FCRST_Msk         (1<<USB_GRSTCTL_FCRST_Pos)
#define USB_GRSTCTL_RXFFLSH_Pos       4					/* RxFIFO flush   */
#define USB_GRSTCTL_RXFFLSH_Msk       (1<<USB_GRSTCTL_RXFFLSH_Pos)
#define USB_GRSTCTL_TXFFLSH_Pos       5 				/* TxFIFO flush   */
#define USB_GRSTCTL_TXFFLSH_Msk       (1<<USB_GRSTCTL_TXFFLSH_Pos)
#define USB_GRSTCTL_TXFNUM_Pos        6	 				/* TxFIFO number   */
#define USB_GRSTCTL_TXFNUM_Msk        (0x1F<<USB_GRSTCTL_TXFNUM_Pos)
#define USB_GRSTCTL_AHBIDL_Pos        31				/* AHB master idle   */
#define USB_GRSTCTL_AHBIDL_Msk        (1<<USB_GRSTCTL_AHBIDL_Pos)

/* --------------------------------  USB_GINTMSK  -------------------------------- */

