mlu/cortal_dendrites/cortex_m/usblib/stm32f7/usb_regs.h
#define USB_GINTMSK_MMISM_Pos         1
#define USB_GINTMSK_MMISM_Msk         (1<<1)
#define USB_GINTMSK_OTGINT_Pos        2
#define USB_GINTMSK_OTGINT_Msk        (1<<2)
#define USB_GINTMSK_SOFM_Pos          3
#define USB_GINTMSK_SOFM_Msk          (1<<3)
#define USB_GINTMSK_RFXLVLM_Pos       4
#define USB_GINTMSK_RXFLVLM_Msk       (1<<4)
#define USB_GINTMSK_NPTXFEM_Pos       5
#define USB_GINTMSK_NPTXFEM_Msk       (1<<5)
#define USB_GINTMSK_GINAKEFFM_Pos     6
#define USB_GINTMSK_GINAKEFFM_Msk     (1<<6)
#define USB_GINTMSK_GONAKEFFM_Pos     7
#define USB_GINTMSK_GONAKEFFM_Msk     (1<<7)
#define USB_GINTMSK_ESUSPM_Pos        10
#define USB_GINTMSK_ESUSPM_Msk        (1<<10)
#define USB_GINTMSK_USBSUSPM_Pos      11
#define USB_GINTMSK_USBSUSPM_Msk      (1<<11)
#define USB_GINTMSK_USBRST_Pos        12
#define USB_GINTMSK_USBRST_Msk        (1<<12)
#define USB_GINTMSK_ENUMDNEM_Pos      13
#define USB_GINTMSK_ENUMDNEM_Msk      (1<<13)
#define USB_GINTMSK_ISOODRPM_Pos      14
#define USB_GINTMSK_ISOODRPM_Msk      (1<<14)
#define USB_GINTMSK_EOPFM_Pos         15
#define USB_GINTMSK_EOPFM_Msk         (1<<15)
#define USB_GINTMSK_EPMISM_Pos        17
#define USB_GINTMSK_EPMISM_Msk        (1<<17)
#define USB_GINTMSK_IEPINT_Pos        18
#define USB_GINTMSK_IEPINT_Msk        (1<<18)
#define USB_GINTMSK_OEPINT_Pos        19
#define USB_GINTMSK_OEPINT_Msk        (1<<19)
#define USB_GINTMSK_PTXFEM_Pos        26				/* Periodic TxFIFO empty mask        */
#define USB_GINTMSK_PTXFEM_Msk        (1<<26)
#define USB_GINTMSK_CIDSCHGM_Pos      28				/* Connector ID status change mask        */
#define USB_GINTMSK_CIDSCHGM_Msk      (1<<28)
#define USB_GINTMSK_DISCINT_Pos       29				/* DISCINTDisconnect detected interrupt mask        */
#define USB_GINTMSK_DISCINT_Msk       (1<<29)
#define USB_GINTMSK_SRQIM_Pos         30				/* Session request/new session detected interrupt mask        */
#define USB_GINTMSK_SRQIM_Msk         (1<<30)
#define USB_GINTMSK_WUIM_Pos          31				/* Resume/remote wakeup detected interrupt mask        */
#define USB_GINTMSK_WUIM_Msk          (1<<31)

/* --------------------------------  USB_GINTSTS  -------------------------------- */

#define USB_GINTSTS_MMIS_Pos          1
#define USB_GINTSTS_MMIS_Msk          (1<<1)
#define USB_GINTSTS_OTGINT_Pos        2
#define USB_GINTSTS_OTGINT_Msk        (1<<2)
#define USB_GINTSTS_SOF_Pos           3
#define USB_GINTSTS_SOF_Msk           (1<<3)
#define USB_GINTSTS_RFXLVL_Pos        4
#define USB_GINTSTS_RXFLVL_Msk        (1<<4)
#define USB_GINTSTS_NPTXFE_Pos        5
#define USB_GINTSTS_NPTXFE_Msk        (1<<5)
#define USB_GINTSTS_GINAKEFF_Pos      6
#define USB_GINTSTS_GINAKEFF_Msk      (1<<6)
#define USB_GINTSTS_GONAKEFF_Pos      7
#define USB_GINTSTS_GONAKEFF_Msk      (1<<7)
#define USB_GINTSTS_ESUSP_Pos         10
#define USB_GINTSTS_ESUSP_Msk         (1<<10)
#define USB_GINTSTS_USBSUSP_Pos       11
#define USB_GINTSTS_USBSUSP_Msk       (1<<11)
#define USB_GINTSTS_USBRST_Pos        12
#define USB_GINTSTS_USBRST_Msk        (1<<12)
#define USB_GINTSTS_ENUMDNE_Pos       13
#define USB_GINTSTS_ENUMDNE_Msk       (1<<13)
#define USB_GINTSTS_ISOODRP_Pos       14
#define USB_GINTSTS_ISOODRP_Msk       (1<<14)
#define USB_GINTSTS_EOPF_Pos          15
#define USB_GINTSTS_EOPF_Msk          (1<<15)
#define USB_GINTSTS_EPMIS_Pos         17
#define USB_GINTSTS_EPMIS_Msk         (1<<17)
#define USB_GINTSTS_IEPINT_Pos        18
#define USB_GINTSTS_IEPINT_Msk        (1<<18)
#define USB_GINTSTS_OEPINT_Pos        19
#define USB_GINTSTS_OEPINT_Msk        (1<<19)
#define USB_GINTSTS_PTXFE_Pos         26				/* Periodic TxFIFO empty mask        */
#define USB_GINTSTS_PTXFE_Msk         (1<<26)
#define USB_GINTSTS_CIDSCHG_Pos       28				/* Connector ID status change mask        */
#define USB_GINTSTS_CIDSCHG_Msk       (1<<28)
#define USB_GINTSTS_DISCINT_Pos       29				/* DISCINTDisconnect detected interrupt mask        */
#define USB_GINTSTS_DISCINT_Msk       (1<<29)
#define USB_GINTSTS_SRQI_Pos          30				/* Session request/new session detected interrupt mask        */
#define USB_GINTSTS_SRQI_Msk          (1<<30)
#define USB_GINTSTS_WUI_Pos           31				/* Resume/remote wakeup detected interrupt mask        */
#define USB_GINTSTS_WUI_Msk           (1<<31)

typedef union _USB_DRXSTS_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t epnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t fn :
    4;
uint32_t Reserved :
    7;
  }
  b;
} USB_DRXSTS_TypeDef ;
typedef union _USB_GRXSTS_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t chnum :
    4;
uint32_t bcnt :
    11;
uint32_t dpid :
    2;
uint32_t pktsts :
    4;
uint32_t Reserved :
    11;
  }
  b;
} USB_GRXFSTS_TypeDef ;

/* ---------------------------------  USB_GRXFSIZ  -------------------------------- */

#define USB_GRXFSIZ_RXFD_Pos          0				/* RxFIFO depth in DWORDS				*/
#define USB_GRXFSIZ_RXFD_Msk          (0xFFFF<<0)

/* --------------------------------  USB_DIEPTXF  -------------------------------- */

#define USB_DIEPTXF_INEPTXSA_Pos      0				/* IN endpoint FIFOx transmit RAM start address		*/
#define USB_DIEPTXF_INEPTXSA_Msk      (0xFFFF<<0)
#define USB_DIEPTXF_INEPTXFD_Pos      16			/* IN endpoint TxFIFO depth	in DWORDS			*/
#define USB_DIEPTXF_INEPTXFD_Msk      (0xFFFF<<16)

typedef union _USB_FSIZ_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t startaddr :
    16;
uint32_t depth :
    16;
  }
  b;
} USB_FSIZ_TypeDef ;
typedef union _USB_HNPTXSTS_TypeDef 
{
  uint32_t d32;
  struct
  {
    uint32_t nptxfspcavail :
      16;
    uint32_t nptxqspcavail :
      8;
      struct
        {
          uint32_t terminate :
            1;
          uint32_t token :
            2;
          uint32_t chnum :
            4; 
         } nptxqtop;
     uint32_t Reserved :
        1;
  }
  b;
} USB_HNPTXSTS_TypeDef ;

/* --------------------------------  USB_DTXFSTS  -------------------------------- */

#define USB_DTXFSTS_INEPTFSAV_Pos      0				/* IN endpoint TxFIFO space available		*/
#define USB_DTXFSTS_INEPTFSAV_Msk      (0xFFFF<<0)

/* --------------------------------  USB_GCCFG  -------------------------------- */

