mlu/cortal_dendrites/cortex_m/usblib/stm32f7/usb_regs.h
/********************  Bit definition for USB_OTG_GCCFG register  ********************/
#define USB_OTG_GCCFG_PWRDWN                 ((uint32_t)0x00010000)              /*!< Power down */
#define USB_OTG_GCCFG_VBDEN                  ((uint32_t)0x00200000)              /*!< USB VBUS Detection Enable */


/* --------------------------------  USB_DCFG  -------------------------------- */

#define USB_DCFG_DSPD_Pos          0				/* Device speed  				*/
#define USB_DCFG_DSPD_Msk          (0x3<<0)
#define USB_DCFG_NZLSOHSK_Pos      2				/* Non-zero-length status OUT handshake 				*/
#define USB_DCFG_NZLSOHSK_Msk      (1<<2)
#define USB_DCFG_DAD_Pos           4				/* Device address 				*/
#define USB_DCFG_DAD_Msk           (0x7F<<4)
#define USB_DCFG_PFIVL_Pos         11				/* Periodic frame interval 		*/
#define USB_DCFG_PFIVL_Msk         (0x3<<11)

/* --------------------------------  USB_DCTL  -------------------------------- */

#define USB_DCTL_RWUSIG_Pos       0				/* Remote wakeup signaling  				*/
#define USB_DCTL_RWUSIG_Msk       (1<<0)
#define USB_DCTL_SDIS_Pos         1				/* Soft disconnect  				*/
#define USB_DCTL_SDIS_Msk         (1<<1)
#define USB_DCTL_GINSTS_Pos       2				/* Global IN NAK status  				*/
#define USB_DCTL_GINSTS_Msk       (1<<2)
#define USB_DCTL_GONSTS_Pos       3				/* Global OUT NAK status  				*/
#define USB_DCTL_GONSTS_Msk       (1<<3)
#define USB_DCTL_TCTL_Pos         4				/* Test control  				*/
#define USB_DCTL_TCTL_Msk         (0x7<<4)
#define USB_DCTL_SGINAK_Pos       7				/* Set global IN NAK  				*/
#define USB_DCTL_SGINAK_Msk       (1<<7)
#define USB_DCTL_CGINAK_Pos       8				/* Clear global IN NAK  				*/
#define USB_DCTL_CGINAK_Msk       (1<<8)
#define USB_DCTL_SGONAK_Pos       9				/* Set global OUT NAK  				*/
#define USB_DCTL_SGONAK_Msk       (1<<9)
#define USB_DCTL_CGONAK_Pos       10			/* Clear global OUT NAK  				*/
#define USB_DCTL_CGONAK_Msk       (1<<10)
#define USB_DCTL_POPRGDNE_Pos     11			/* POPRGDNEPower-on programming done  				*/
#define USB_DCTL_POPRGDNE_Msk     (1<<11)

typedef union _USB_DSTS_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t suspsts :
    1;
uint32_t enumspd :
    2;
uint32_t errticerr :
    1;
uint32_t Reserved4_7:
    4;
uint32_t soffn :
    14;
uint32_t Reserved22_31 :
    10;
  }
  b;
} USB_DSTS_TypeDef ;


#define USB_DOEPINT_XFRC_Pos                 0            /* Transfer completed interrupt        */
#define USB_DOEPINT_XFRC_Msk                 (1 << 0)
#define USB_DOEPINT_EPDISD_Pos               1            /* Endpoint disabled interrupt       */
#define USB_DOEPINT_EPDISD_Msk               (1 << 1)
#define USB_DOEPINT_STUP_Pos                 3            /* SETUP phase done        */
#define USB_DOEPINT_STUP_Msk                 (1 << 3)
#define USB_DOEPINT_OTEPDIS_Pos              4            /* OUT token received when endpoint disabled        */
#define USB_DOEPINT_OTEPDIS_Msk              (1 << 4)
#define USB_DOEPINT_B2BSTUP_Pos              6            /* Back-to-back SETUP packets received       */
#define USB_DOEPINT_B2BSTUP_Msk              (1 << 6)

#define USB_DIEPINT_XFRC_Pos                 0            /* Transfer completed interrupt        */
#define USB_DIEPINT_XFRC_Msk                 (1 << 0)
#define USB_DIEPINT_EPDISD_Pos               1            /* Endpoint disabled interrupt       */
#define USB_DIEPINT_EPDISD_Msk               (1 << 1)
#define USB_DIEPINT_TOC_Pos                  3            /* Timeout condition    */
#define USB_DIEPINT_TOC_Msk                  (1 << 3)
#define USB_DIEPINT_ITTXFE_Pos               4            /* IN token received when TxFIFO is empty       */
#define USB_DIEPINT_ITTXFE_Msk               (1 << 4)
#define USB_DIEPINT_INEPNE_Pos               6            /* IN endpoint NAK effective      */
#define USB_DIEPINT_INEPNE_Msk               (1 << 6)
#define USB_DIEPINT_TXFE_Pos                 7            /* Transmit FIFO empty      */
#define USB_DIEPINT_TXFE_Msk                 (1 << 7)

/* ----------------------------------  USB_DAINT  --------------------------------- */

#define USB_DAINT_IEPINT_Pos                 0                                                       /* InEpInt Position             */
#define USB_DAINT_IEPINT_Msk                 (0x0000ffffUL << 0)                 /* InEpInt Mask                 */
#define USB_DAINT_OEPINT_Pos                 16                                                      /* OutEPInt Position            */
#define USB_DAINT_OEPINT_Msk                 (0x0000ffffUL << 16)                /* OutEPInt Mask                */

/* --------------------------------  USB_DAINTMSK  -------------------------------- */

#define USB_DAINTMSK_IEPM_Pos              0                                                       /* InEpMsk Position          */
#define USB_DAINTMSK_IEPM_Msk              (0x0000ffffUL << 0s)              /* InEpMsk Mask              */
#define USB_DAINTMSK_OEPM_Pos             16                                                      /* OutEpMsk Position         */
#define USB_DAINTMSK_OEPM_Msk             (0x0000ffffUL << 16)             /* OutEpMsk Mask             */

typedef union _USB_DTHRCTL_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t non_iso_thr_en :
    1;
uint32_t iso_thr_en :
    1;
uint32_t tx_thr_len :
    9;
uint32_t Reserved11_15 :
    5;
uint32_t rx_thr_en :
    1;
uint32_t rx_thr_len :
    9;
uint32_t Reserved26 : 
    1;
uint32_t arp_en :  
    1;
uint32_t Reserved28_31 :
    4;   
  }
  b;
} USB_DTHRCTL_TypeDef ;

#define USB_DEPCTL_MPSIZ_Pos       	0				/* MPSIZMaximum packet size 		*/
#define USB_DEPCTL_MPSIZ_Msk       	(0x3FF<<0)
#define USB_DEPCTL_USBAEP_Pos       15				/* USB active endpoint 				*/
#define USB_DEPCTL_USBAEP_Msk       (1<<15)
#define USB_DEPCTL_DPID_Pos         16				/* Endpoint data PID 				*/
#define USB_DEPCTL_DPID_Msk         (1<<16)
#define USB_DEPCTL_EPTYP_Pos       	18				/* Endpoint type				*/
#define USB_DEPCTL_EPTYP_Msk       	(0x3<<18)
#define USB_DEPCTL_STALL_Pos       	21				/* STALL handshake 				*/
#define USB_DEPCTL_STALL_Msk       	(1<<21)
#define USB_DEPCTL_TXFNUM_Pos      	22				/* TxFIFO number				*/
#define USB_DEPCTL_TXFNUM_Msk      	(0xF<<22)
#define USB_DEPCTL_CNAK_Pos       	26				/* Clear NAK 				*/
#define USB_DEPCTL_CNAK_Msk       	(1<<26)
#define USB_DEPCTL_SNAK_Pos       	27				/* Set NAK 				*/
#define USB_DEPCTL_SNAK_Msk       	(1<<27)
#define USB_DEPCTL_SD0PID_Pos      	28				/* Set DATA0 PID		*/
#define USB_DEPCTL_SD0PID_Msk      	(1<<28)
#define USB_DEPCTL_EPENA_Pos       	31				/* Endpoint enable			*/
#define USB_DEPCTL_EPENA_Msk       	(1<<31)

