mlu/cortal_dendrites/cortex_m/usblib/stm32f7/usb_regs.h
typedef union _USB_DEPXFRSIZ_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t xfersize :
    19;
uint32_t pktcnt :
    10;
uint32_t mc :
    2;
uint32_t Reserved :
    1;
  }
  b;
} USB_DEPXFRSIZ_TypeDef ;
typedef union _USB_DEP0XFRSIZ_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t xfersize :
    7;
uint32_t Reserved7_18 :
    12;
uint32_t pktcnt :
    2;
uint32_t Reserved20_28 :
    9;
uint32_t supcnt :
    2;
    uint32_t Reserved31;
  }
  b;
} USB_DEP0XFRSIZ_TypeDef ;

/*************** OTG_FS device OUT endpoint 0 transfer size register (OTG_FS_DOEPTSIZ0)   0xB10 *************/

#define USB_DOEPTSIZ0_XFRSIZ_Pos       0				/* Transfer size 				*/
#define USB_DOEPTSIZ0_XFRSIZ_Msk       (0x7F<<0)
#define USB_DOEPTSIZ0_PKTCNT_Pos       19				/* Packet count 				*/
#define USB_DOEPTSIZ0_PKTCNT_Msk       (1<<19)
#define USB_DOEPTSIZ0_STUPCNT_Pos      29				/* SETUP packet count 				*/
#define USB_DOEPTSIZ0_STUPCNT_Msk      (0x3<<29)

/*************** OTG_FS device OUT endpoint 0 transfer size register (OTG_FS_DOEPTSIZ)   *************/

#define USB_DOEPTSIZ_XFRSIZ_Pos        0				/* Transfer size 				*/
#define USB_DOEPTSIZ_XFRSIZ_Msk        (0x3FF<<0)
#define USB_DOEPTSIZ_PKTCNT_Pos        19				/* Packet count 				*/
#define USB_DOEPTSIZ_PKTCNT_Msk        (0x7<<19)

/*************** OTG_FS device OUT endpoint 0 transfer size register (OTG_FS_DIEPTSIZ0)    *************/

#define USB_DIEPTSIZ0_XFRSIZ_Pos       0				/* Transfer size 				*/
#define USB_DIEPTSIZ0_XFRSIZ_Msk       (0x7F<<0)
#define USB_DIEPTSIZ0_PKTCNT_Pos       19				/* Packet count 				*/
#define USB_DIEPTSIZ0_PKTCNT_Msk       (3<<19)

/*************** OTG_FS device OUT endpoint 0 transfer size register (OTG_FS_DIEPTSIZ)   *************/

#define USB_DIEPTSIZ_XFRSIZ_Pos        0				/* Transfer size 				*/
#define USB_DIEPTSIZ_XFRSIZ_Msk        (0x3FF<<0)
#define USB_DIEPTSIZ_PKTCNT_Pos        19				/* Packet count 				*/
#define USB_DIEPTSIZ_PKTCNT_Msk        (0x7<<19)



typedef union _USB_PCGCCTL_TypeDef 
{
  uint32_t d32;
  struct
  {
uint32_t stoppclk :
    1;
uint32_t gatehclk :
    1;
uint32_t Reserved2_3 :
    2;
uint32_t phy_susp :
    1;    
uint32_t Reserved5_31 :
    27;
  }
  b;
} USB_PCGCCTL_TypeDef ;



#endif //__USB_REGS_H__


